backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 513, 513, 3, 1]
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1, 1]
      dtype: float32
      filters: 10
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_1
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv3d_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_1, trainable: true}
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_1
  - class_name: MaxPooling3D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling3d
      padding: same
      pool_size: &id002 !!python/tuple [3, 3, 3]
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_1
        - 0
        - 0
        - {}
    name: max_pooling3d
  - class_name: Dropout
    config: {dtype: float32, name: dropout, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - max_pooling3d
        - 0
        - 0
        - {}
    name: dropout
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 20
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_3
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout
        - 0
        - 0
        - {}
    name: conv3d_3
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_3
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_3, trainable: true}
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: leaky_re_lu_3
  - class_name: MaxPooling3D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling3d_1
      padding: same
      pool_size: *id002
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_3
        - 0
        - 0
        - {}
    name: max_pooling3d_1
  - class_name: Dropout
    config: {dtype: float32, name: dropout_1, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - max_pooling3d_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 40
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_5
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: conv3d_5
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_5
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_5, trainable: true}
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: leaky_re_lu_5
  - class_name: MaxPooling3D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling3d_2
      padding: same
      pool_size: *id002
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_5
        - 0
        - 0
        - {}
    name: max_pooling3d_2
  - class_name: Dropout
    config: {dtype: float32, name: dropout_2, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - max_pooling3d_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_7
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: conv3d_7
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_7
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_7, trainable: true}
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: leaky_re_lu_7
  - class_name: MaxPooling3D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling3d_3
      padding: same
      pool_size: &id003 !!python/tuple [3, 3, 1]
      strides: *id003
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_7
        - 0
        - 0
        - {}
    name: max_pooling3d_3
  - class_name: Dropout
    config: {dtype: float32, name: dropout_3, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - max_pooling3d_3
        - 0
        - 0
        - {}
    name: dropout_3
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_9
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: conv3d_9
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_9
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_9, trainable: true}
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: leaky_re_lu_9
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [4, 4, 4]
      name: conv3d_transpose
      output_padding: null
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_9
        - 0
        - 0
        - {}
    name: conv3d_transpose
  - class_name: Cropping3D
    config:
      cropping: !!python/tuple
      - &id004 !!python/tuple [2, 0]
      - *id004
      - !!python/tuple [0, 0]
      data_format: channels_last
      dtype: float32
      name: cropping3d
      trainable: true
    inbound_nodes:
    - - - conv3d_transpose
        - 0
        - 0
        - {}
    name: cropping3d
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate, trainable: true}
    inbound_nodes:
    - - - cropping3d
        - 0
        - 0
        - &id005 {}
      - - leaky_re_lu_7
        - 0
        - 0
        - *id005
    name: concatenate
  - class_name: Dropout
    config: {dtype: float32, name: dropout_4, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - concatenate
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_11
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: conv3d_11
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_11
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_11, trainable: true}
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: leaky_re_lu_11
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 40
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: conv3d_transpose_1
      output_padding: null
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_11
        - 0
        - 0
        - {}
    name: conv3d_transpose_1
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - conv3d_transpose_1
        - 0
        - 0
        - &id007 {}
      - - leaky_re_lu_5
        - 0
        - 0
        - *id007
    name: concatenate_1
  - class_name: Dropout
    config: {dtype: float32, name: dropout_5, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: dropout_5
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 40
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_13
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - {}
    name: conv3d_13
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_13
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_13, trainable: true}
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: leaky_re_lu_13
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 20
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: conv3d_transpose_2
      output_padding: null
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_13
        - 0
        - 0
        - {}
    name: conv3d_transpose_2
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - conv3d_transpose_2
        - 0
        - 0
        - &id008 {}
      - - leaky_re_lu_3
        - 0
        - 0
        - *id008
    name: concatenate_2
  - class_name: Dropout
    config: {dtype: float32, name: dropout_6, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: dropout_6
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 20
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_15
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_6
        - 0
        - 0
        - {}
    name: conv3d_15
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_15
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_15
        - 0
        - 0
        - {}
    name: batch_normalization_15
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_15, trainable: true}
    inbound_nodes:
    - - - batch_normalization_15
        - 0
        - 0
        - {}
    name: leaky_re_lu_15
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 10
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: conv3d_transpose_3
      output_padding: null
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_15
        - 0
        - 0
        - {}
    name: conv3d_transpose_3
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_3, trainable: true}
    inbound_nodes:
    - - - conv3d_transpose_3
        - 0
        - 0
        - &id009 {}
      - - leaky_re_lu_1
        - 0
        - 0
        - *id009
    name: concatenate_3
  - class_name: Dropout
    config: {dtype: float32, name: dropout_7, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: dropout_7
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 10
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_17
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_7
        - 0
        - 0
        - {}
    name: conv3d_17
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_17
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_17
        - 0
        - 0
        - {}
    name: batch_normalization_17
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_17, trainable: true}
    inbound_nodes:
    - - - batch_normalization_17
        - 0
        - 0
        - {}
    name: leaky_re_lu_17
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 10
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4, 4]
      name: conv3d_19
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_17
        - 0
        - 0
        - {}
    name: conv3d_19
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [4]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_19
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_19
        - 0
        - 0
        - {}
    name: batch_normalization_19
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_19, trainable: true}
    inbound_nodes:
    - - - batch_normalization_19
        - 0
        - 0
        - {}
    name: leaky_re_lu_19
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1, 2]
      name: conv3d_20
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_19
        - 0
        - 0
        - {}
    name: conv3d_20
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, dtype: float32, name: leaky_re_lu_20, trainable: true}
    inbound_nodes:
    - - - conv3d_20
        - 0
        - 0
        - {}
    name: leaky_re_lu_20
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 32
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_20
        - 0
        - 0
        - {}
    name: dense
  - class_name: Conv3D
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.019999999552965164}
      kernel_size: !!python/tuple [1, 1, 1]
      name: conv3d_21
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dense
        - 0
        - 0
        - {}
    name: conv3d_21
  name: model
  output_layers:
  - [conv3d_21, 0, 0]
keras_version: 2.3.0-tf
